\assignementTitle{Асинхронный маячок}{3}{}

К цифровым пинам контроллера Ардуино подключены 3 светодиода разных цветов (красный, желтый и зеленый).   Напишите
программу, которая будет одновременно мигать этими светодиодами, причем каждым - со своим периодом и скважностью.  
В начальный момент времени все 3 светодиода должны включиться одновременно. 

Входные данные мини-симулятор считывает автоматически, но вам нужно использовать переменные, как указано в шаблоне кода.  Как и в предыдущем примере, вам доступны функции pinMode(), digitalWrite() и delay().

\begin{myverbbox}[\small]{\vinput}
    33 10 41 20 73 25
\end{myverbbox}
\begin{myverbbox}[\small]{\voutput}
    000000DW03=1
    000000DW04=1
    000000DW05=1
    000010DW03=0
    000020DW04=0
    000025DW05=0
    000033DW03=1
    000041DW04=1
    000043DW03=0
    000061DW04=0
    000066DW03=1
    000073DW05=1
    ...
\end{myverbbox}
\inputoutputTable

%\includeSolutionIfExistsByPath{2nd_tour/bas/task_01}