\assignementTitle{Полицейский маячок (BLINK со встречным подключением светодиодов)}{3}{}

Два светодиода, красный и зеленый, подключены к Ардуино, как показано на схеме:

\putImgWOCaption{9cm}{1}

Напишите программу, которая попеременно мигает красным и зеленым светодиодами, без "темных" 
интервалов.  Каждый светодиод включен LED\_PERIOD миллисекунд (интервал меняется от теста к тесту).  
Какой из светодиодов зажигается первым,  роли не играет.  Имеются функции  pinMode(), 
digitalWrite(), delay().  

\begin{myverbbox}[\small]{\vinput}
    100
\end{myverbbox}
\begin{myverbbox}[\small]{\voutput}
    0 OK
    100 OK
    200 OK
    300 OK
    400 OK
\end{myverbbox}
\inputoutputTable

%\includeSolutionIfExistsByPath{2nd_tour/bas/task_01}