\assignementTitle{Полицейский маячок (BLINK со встречным подключением светодиодов)}{3}{}

Два светодиода, красный и зеленый, подключены к Ардуино, как показано на схеме:

\putImgWOCaption{9cm}{1}

Напишите программу, которая попеременно мигает красным и зеленым светодиодами, без "темных" 
интервалов.  Каждый светодиод включен LED\_PERIOD миллисекунд (интервал меняется от теста к тесту).  
Какой из светодиодов зажигается первым,  роли не играет.  Имеются функции  pinMode(), 
digitalWrite(), delay().  

\solutionSection

Это еще одна супер-легкая задача, рассчитанная на то, чтобы дать вам разобраться с написанием кода для мини-симулятора.  Раз диоды подключены "встречно", программа должна попеременно подавать LOW на D11 и HIGH на D12 (включен LED2) или  HIGH на D11 и LOW на D12 (включен LED2).  Для мини-симулятора "одновременными" считаются действия, выполняемые без вызова delay() между ними.  

Прежде, чем писать собственно код для переключения, не забываем инициализировать соответствующие пины как выходные.  При этом обязательно использовать именованные константы, приведенные в шаблоне кода,  а не числа:

\begin{minted}[fontsize = \footnotesize, linenos]{cpp}
void setup()
{
    pinMode(LED_PIN1, OUTPUT);
        pinMode(LED_PIN2, OUTPUT);
}        
\end{minted}

Вот самое простое (и тупое) решение для поочередного мигания (и опять-таки, обязательно используем параметр LED\_PERIOD, приведенный в шаблоне кода. Он будет принимать разные значения для разных тестов, и иначе программа правильный ответ не выдаст):

\begin{minted}[fontsize = \footnotesize, linenos]{cpp}
void loop()
{
    digitalWrite(LED_PIN1, HIGH);
    digitalWrite(LED_PIN2, LOW);
    delay(LED_PERIOD); 
    digitalWrite(LED_PIN1, LOW;
    digitalWrite(LED_PIN2, HIGH));
    delay(LED_PERIOD); 
}            
\end{minted}

А вот чуть более интересное решение с использованием переменной:

\begin{minted}[fontsize = \footnotesize, linenos]{cpp}
bool b = true;

void loop()
{
    digitalWrite(LED_PIN1, b);
    b = !b;
    digitalWrite(LED_PIN2, b);
    delay(LED_PERIOD); 
}
\end{minted}

\textbf{Отступление} (для продвинутых): 

В реальном контроллере между соседними вызовами digitalWrite() будет, разумеется, некая микросекундная задержка. Для данной задачи это никакой роли не играет, но в некоторых ситуациях может быть важным.  Используя только вызовы из библиотеки Ардуино, невозможно строго одновременно управлять несколькими пинами. 

Сам микроконтроллер ATMEGA, тем не менее, это делать позволяет.  На  аппаратном уровне, "пины"\ (входы/выходы) контроллеры объединены в 8-битовые "порты"{}, доступные как регистры контроллера, а на уровне языка C - как специальные переменные. Таким образом, можно строго одновременно, за 1 такт микроконтроллера, менять состояние до 8 пинов! 

Если вы загуглите "ATMEGA ArduinoUNO pin mapping", то найдете, например, вот такую картинку:

\putImgWOCaption{10cm}{2}

В контексте данной задачи, нам важен тот факт,что пинам Arduino D11 и D12 соответствуют биты 3 и 4 порта B контроллера ATMEGA. На языке C, к ним можно обратиться следующим образом (причем это действует не только в "настоящей" среде разработки AVRStudio, но и в среде Arduino!):

\begin{minted}[fontsize = \footnotesize, linenos]{cpp}
void setup()
{
   DDRB =  0b00011000;   // заменяет pinMode, устанавливая PB3 и PB4 в OUTPUT
   PORTA = 0b00010000;   // начальное состояние: PB3(D11) = 0, PB4(D12) = 1
}
void loop()
{
   PORTA ^= 0b00011000;  // одной командой переключаем оба пина!
   delay(LED_PERIOD); 
}
\end{minted}

Такая программа не только выполняется  на реальном контроллере гораздо быстрее, но и занимает меньше места в памяти программ, чем код с вызовами функций библиотеки Ардуино.  Обратите внимание, что если бы светодиоды были подключены, например, к пинам D7 и D8, то показанный выше трюк у нас бы не прошел, т.к. эти пины относятся к разным портам и не могут изменяться одной командой.

К сожалению, в мини-симуляторе низкоуровневая работа с портами не поддерживается, поэтому приведенный выше код не может быть решением данной задачи в Stepik.  Тем не менее,  любознательным среди вас составители задания советуют попробовать такую программку на реальном Ардуино и, по документации к контроллеру ATMega  разобраться с псевдо-переменными  PORTx, PINx и DDRx.
